# AtomViolationWhenOnePlaceInstance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..AtomViolationWhenOnePlaceInstance Property
BuiltInFailures..::..GroupFailures Class See Also
---
A group has been changed outside group edit mode. The change is being allowed because there is only one instance of the type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AtomViolationWhenOnePlaceInstance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AtomViolationWhenOnePlaceInstance As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AtomViolationWhenOnePlaceInstance {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace